//-----------------------------------------------------------------------------
// Window_NameInput
//
// The window for selecting text characters on the name input screen.



// prettier-ignore
Window_NameInput.LATIN1 =
        [ '一','二','三','四','五',  '红','黄','蓝','紫','黑',
          '六','七','八','九','十',  '大','小','萌','绿','青',
          '床','前','明','月','光',  '橙','白','铁','吞','圣',
          '疑','是','地','上','霜',  '音','乐','马','猴','猪',
          '霸','王','雪','狼','狐',  '鸟','雀','鹰','的','之',
          '舞','百','合','花','开',  '鸡','金','木','水','火',
          '迷','你','玲','珑','神',  '土','雷','风','丛','林',
          '下','左','右','飞','空',  '魔','冰','蛇','犬','天',
          '宝','贝','魂','玉','银',  '蜂','龙','牛','翻页','确认' ];
// prettier-ignore
Window_NameInput.LATIN2 =
        [ '东','南','西','北','中',  '胖','庞','螃','狮','虎',
          '笑','啸','萧','霄','晓',  '太','泰','阳','洋','羊',
          '弓','公','攻','宮','功',  '力','莉','丽','梨','黎',
          '法','罚','反','烦','饭',  '翻','犯','梵','芳','房',
          '放','房','方','仿','防',  '分','粉','奋','愤','焚',
          '封','疯','枫','凤','锋',  '血','写','蟹','削','鳕',
          '我','答','猜','不','乾',  '坤','案','理','智','信',
          '啊','阿','奥','傲','鳌',  '爱','哎','矮','哀','吼',
          '暗','岸','艾','诶','恶',  '呵','哈','嘿','翻页','确认' ];
// prettier-ignore
Window_NameInput.LATIN3 =
        [ '那','哪','拿','娜','末',  '莫','抹','墨','默','陌',
          '沫','漠','茶','刹','差',  '岔','仙','神','人','穹',
          '帅','的','得','德','の',  '快','块','侩','筷','子',
          '珍','楠','美','莉','丽',  '媛','爱','泽','咲','夜',
          '桂','雏','菊','雪','露',  '玛','雅','千','院','芷',
          '凪','莲','寺','璐','佳',  '珈','伽','春','夏','秋',
          '冬','樱','符','王','州',  '典','茜','姬','慕','容',
          '兵','将','皇','侍','相',  '长','门','有','希','菱',
          '御','鱼','语','姐','界',  '萝','落','依','翻页','确认' ];
Window_NameInput.RUSSIA =
        [ "А","Б","В","Г","Д",  "а","б","в","г","д",
          "Е","Ё","Ж","З","И",  "е","ё","ж","з","и",
          "Й","К","Л","М","Н",  "й","к","л","м","н",
          "О","П","Р","С","Т",  "о","п","р","с","т",
          "У","Ф","Х","Ц","Ч",  "у","ф","х","ц","ч",
          "Ш","Щ","Ъ","Ы","Ь",  "ш","щ","ъ","ы","ь",
          "Э","Ю","Я","^","_",  "э","ю","я","%","&",
          "0","1","2","3","4",  "(",")","*","+","-",
          "5","6","7","8","9",  ":",";"," ","","OK" ];
// prettier-ignore
Window_NameInput.JAPAN1 =
        [ "あ","い","う","え","お",  "が","ぎ","ぐ","げ","ご",
          "か","き","く","け","こ",  "ざ","じ","ず","ぜ","ぞ",
          "さ","し","す","せ","そ",  "だ","ぢ","づ","で","ど",
          "た","ち","つ","て","と",  "ば","び","ぶ","べ","ぼ",
          "な","に","ぬ","ね","の",  "ぱ","ぴ","ぷ","ぺ","ぽ",
          "は","ひ","ふ","へ","ほ",  "ぁ","ぃ","ぅ","ぇ","ぉ",
          "ま","み","む","め","も",  "っ","ゃ","ゅ","ょ","ゎ",
          "や","ゆ","よ","わ","ん",  "ー","～","・","＝","☆",
          "ら","り","る","れ","ろ",  "ゔ","を","　","カナ","決定" ];
// prettier-ignore
Window_NameInput.JAPAN2 =
        [ "ア","イ","ウ","エ","オ",  "ガ","ギ","グ","ゲ","ゴ",
          "カ","キ","ク","ケ","コ",  "ザ","ジ","ズ","ゼ","ゾ",
          "サ","シ","ス","セ","ソ",  "ダ","ヂ","ヅ","デ","ド",
          "タ","チ","ツ","テ","ト",  "バ","ビ","ブ","ベ","ボ",
          "ナ","ニ","ヌ","ネ","ノ",  "パ","ピ","プ","ペ","ポ",
          "ハ","ヒ","フ","ヘ","ホ",  "ァ","ィ","ゥ","ェ","ォ",
          "マ","ミ","ム","メ","モ",  "ッ","ャ","ュ","ョ","ヮ",
          "ヤ","ユ","ヨ","ワ","ン",  "ー","～","・","＝","☆",
          "ラ","リ","ル","レ","ロ",  "ヴ","ヲ","　","英数","決定" ];
// prettier-ignore
Window_NameInput.JAPAN3 =
        [ "Ａ","Ｂ","Ｃ","Ｄ","Ｅ",  "ａ","ｂ","ｃ","ｄ","ｅ",
          "Ｆ","Ｇ","Ｈ","Ｉ","Ｊ",  "ｆ","ｇ","ｈ","ｉ","ｊ",
          "Ｋ","Ｌ","Ｍ","Ｎ","Ｏ",  "ｋ","ｌ","ｍ","ｎ","ｏ",
          "Ｐ","Ｑ","Ｒ","Ｓ","Ｔ",  "ｐ","ｑ","ｒ","ｓ","ｔ",
          "Ｕ","Ｖ","Ｗ","Ｘ","Ｙ",  "ｕ","ｖ","ｗ","ｘ","ｙ",
          "Ｚ","［","］","＾","＿",  "ｚ","｛","｝","｜","～",
          "０","１","２","３","４",  "！","＃","＄","％","＆",
          "５","６","７","８","９",  "（","）","＊","＋","－",
          "／","＝","＠","＜","＞",  "：","；","　","かな","決定" ];



Window_NameInput.prototype.table = function() {
    if ($gameSystem.isJapanese()) {
        return [
            Window_NameInput.JAPAN1,
            Window_NameInput.JAPAN2,
            Window_NameInput.JAPAN3
        ];
    } else if ($gameSystem.isRussian()) {
        return [Window_NameInput.RUSSIA];
    } else {
        return [Window_NameInput.LATIN1, 
		        Window_NameInput.LATIN2,
				Window_NameInput.LATIN3
				];
    }
};